OpenFOAM/OpenFOAM-5.x/tutorials/combustion/reactingFoam/RAS/DLR_A_LTS/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    inletfuel
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        phi             phi;
        k               k;
        value           uniform 200;
    }
    inletair
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        phi             phi;
        k               k;
        value           uniform 200;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }
    axis
    {
        type            empty;
    }
    leftside
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 200;
    }
    burnerwall
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 200;
    }
    burnertip
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 200;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
